# Überprüfung der bereinigten Daten

In [1]:
import duckdb as dd

In [2]:
con = dd.connect(r"data.db")

In [3]:
# Beispiel Aufruf über die Tabellen Customer und City
con.execute(
    """
    SELECT 
      customer_id, 
      first_name, 
      last_name, 
      city.city as city 
    FROM 
      Customer 
    JOIN City ON Customer.city_id = City.city_id 
    WHERE First_Name = 'Alex'
    LIMIT 10"""
).df()

   customer_id First_Name Last_Name           city
0   7783331561       Alex  Espinoza      Davisfort
1   5946482583       Alex     Moran   North Travis
2   8653157992       Alex     Jones     Millerview
3   3965299214       Alex     Banks   Calderonport
4   4138394784       Alex     Perez  Hernandezstad
5   4923948553       Alex   Schultz  Daniellemouth
6   7996332944       Alex     White   South Ashley
7   3543458174       Alex     Moyer    North Henry
8   8131667949       Alex     Yates    Harrisshire
9   3262172741       Alex    Gamble    North Shawn

In [4]:
con.execute("describe select * from Usage;").df()

       column_name column_type null   key default extra
0      customer_id      BIGINT  YES  None    None  None
1       service_id      BIGINT  YES  None    None  None
2       Usage Time   TIMESTAMP  YES  None    None  None
3  Status last use     VARCHAR  YES  None    None  None

In [5]:
con.execute(
    """select * from Usage where "Usage Time" < TIMESTAMP '1900-01-01 00:00:00'"""
).df()

Empty DataFrame
Columns: [customer_id, service_id, Usage Time, Status last use]
Index: []

In [6]:
con.execute(
    """
    SELECT count(*) FROM Usage;
    """
).df()

   count_star()
0        100000

In [7]:
con.execute(
    """
    SELECT * FROM Usage LIMIT 10;    
    """
).df()

   customer_id  service_id          Usage Time Status last use
0   5758474874           3 2020-11-08 23:27:40         Success
1   8328174452           5 2011-10-26 23:44:25         Failure
2   9698496939           4 2012-04-18 04:04:29         Success
3   3287392249           1 2012-01-26 03:43:23         Failure
4   5665655861           5 2008-09-21 03:04:59         Success
5   9651131487           5 1997-12-04 21:36:31         Failure
6   9858239389           5 2018-08-25 01:11:33         Success
7   8949436788           6 2002-03-07 12:55:28         Failure
8   8871392477           5 2015-02-13 12:25:39         Failure
9   5918335291           6 2015-10-20 23:47:08         Success

In [ ]:
con.execute(
    """
    SELECT * FROM Customer LIMIT 10;    
    """
).df()

In [ ]:
con.execute(
    """
    SELECT * FROM Service LIMIT 10;    
    """
).df()

In [8]:
con.execute(
"""
select distinct service_id from Usage where service_id not in (select service_id from Service) 
"""
).df()

Empty DataFrame
Columns: [service_id]
Index: []

In [9]:
con.execute("select distinct city_id from Customer where city_id not in (select city_id from City)").df()

Empty DataFrame
Columns: [city_id]
Index: []

In [10]:
con.execute("select * from Customer where city_id is Null").df()

Empty DataFrame
Columns: [customer_id, First_Name, Last_Name, city_id]
Index: []

In [11]:
con.execute("""SELECT customer_id, COUNT(*) 
FROM Customer 
GROUP BY customer_id 
HAVING COUNT(*) > 1;""").df()

Empty DataFrame
Columns: [customer_id, count_star()]
Index: []

In [12]:
con.execute("describe select * from usage;").df()

       column_name column_type null   key default extra
0      customer_id      BIGINT  YES  None    None  None
1       service_id      BIGINT  YES  None    None  None
2       Usage Time   TIMESTAMP  YES  None    None  None
3  Status last use     VARCHAR  YES  None    None  None

In [13]:
con.execute("""SELECT customer_id, service_id, COUNT(*) 
FROM Usage
GROUP BY customer_id, service_id 
HAVING COUNT(*) > 1;""").df()

Empty DataFrame
Columns: [customer_id, service_id, count_star()]
Index: []

In [14]:
con.execute("select * from Service;").df()

   service_id        service_name  costs_per_month
0           1           Streaming            19.99
1           2           Databases             9.99
2           3  Custom Development           199.99
3           4          Automation            89.99
4           5            Hardware            12.69
5           6          E-Commerce            39.99
6           7          Bi Tooling             8.99
7         999           Databases            59.99

In [15]:
con.execute("""SELECT city, COUNT(*)
FROM City
GROUP BY city
HAVING COUNT(*) > 1;""").df()

Empty DataFrame
Columns: [City, count_star()]
Index: []

In [16]:
con.execute("""
            SELECT COUNT(*) AS row_count FROM Customer;
            --SELECT COUNT(*) AS row_count_city FROM City;
            --SELECT COUNT(*) AS row_count_service FROM Service;
            --SELECT COUNT(*) AS row_count_usage FROM Usage;""").df()

   row_count
0     100000

In [17]:
con.execute("select distinct \"Status last use\" from Usage").df()

  Status last use
0         Success
1         Failure

In [18]:
con.close()